{
  "Severity": "HIGH",
  "UpdatedAt": "2025-12-26T17:30:20Z",
  "Package": {
    "Ecosystem": "NPM",
    "Name": "n8n"
  },
  "Advisory": {
    "DatabaseId": 328731,
    "Id": "GSA_kwCzR0hTQS01OGpjLXJjZzUtOTVmM84ABQQb",
    "GhsaId": "GHSA-58jc-rcg5-95f3",
    "References": [
      {
        "Url": "https://github.com/n8n-io/n8n/security/advisories/GHSA-58jc-rcg5-95f3"
      },
      {
        "Url": "https://github.com/advisories/GHSA-58jc-rcg5-95f3"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-58jc-rcg5-95f3"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-61914"
      }
    ],
    "Description": "### Summary\nA stored Cross-Site Scripting (XSS) vulnerability may occur in n8n when using the “Respond to Webhook” node.\nWhen this node responds with HTML content containing executable scripts, the payload may execute directly in the top-level window, rather than within the expected sandbox introduced in version 1.103.0.\n\nThis behavior can enable a malicious actor with workflow creation permissions to execute arbitrary JavaScript in the context of the n8n editor interface.\n\nWhile session cookies (`n8n-auth`) are marked `HttpOnly` and cannot be directly exfiltrated, the vulnerability can facilitate Cross-Site Request Forgery (CSRF)-like actions from within the user’s authenticated session, potentially allowing:\n\n- Unauthorized reading of sensitive workflow data or execution history.\n- Unauthorized modification or deletion of workflows.\n- Insertion of malicious workflow logic or external data exfiltration steps.\n\nn8n instances that allow untrusted users to create workflows are particularly impacted.\n\n### Patches\nThe vulnerability has been patched in v.1.114.0.\n\n### Workarounds\n- Restrict workflow creation and modification privileges to trusted users only.\n- Avoid using untrusted HTML responses in the “Respond to Webhook” node.\n- Use an external reverse proxy or HTML sanitizer to filter responses that include executable scripts.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-12-26T17:30:19Z",
    "Severity": "HIGH",
    "Summary": "n8n's Possible Stored XSS in \"Respond to Webhook\" Node May Execute Outside iframe Sandbox",
    "UpdatedAt": "2025-12-26T17:30:20Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 7.3,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:N"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "1.114.0"
      },
      "VulnerableVersionRange": "\u003c 1.114.0"
    }
  ]
}