{
  "Severity": "MODERATE",
  "UpdatedAt": "2026-01-16T16:58:17Z",
  "Package": {
    "Ecosystem": "PIP",
    "Name": "distributed"
  },
  "Advisory": {
    "DatabaseId": 332559,
    "Id": "GSA_kwCzR0hTQS1jMzM2LTc5NjItd2ZqMs4ABRMP",
    "GhsaId": "GHSA-c336-7962-wfj2",
    "References": [
      {
        "Url": "https://github.com/dask/distributed/security/advisories/GHSA-c336-7962-wfj2"
      },
      {
        "Url": "https://github.com/dask/distributed/commit/ab72092a8a938923c2bb51a2cd14ca26614827fa"
      },
      {
        "Url": "https://github.com/advisories/GHSA-c336-7962-wfj2"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-c336-7962-wfj2"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2026-23528"
      }
    ],
    "Description": "### Impact\nWhen [Jupyter Lab](https://jupyterlab.readthedocs.io/en/latest/), [jupyter-server-proxy](https://github.com/jupyterhub/jupyter-server-proxy) and [Dask distributed](https://github.com/dask/distributed) are all run together it is possible to craft a URL which will result in code being executed by Jupyter due to a cross-side-scripting (XSS) bug in the Dask dashboard.\n\nIt is possible for attackers to craft a phishing URL that assumes Jupyter Lab and Dask may be running on localhost and using default ports. If a user clicks on the malicious link it will open an error page in the Dask Dashboard via the Jupyter Lab proxy which will cause code to be executed by the default Jupyter Python kernel.\n\nIn order for a user to be impacted they must be running Jupyter Lab locally on the default port (with the [jupyter-server-proxy](https://github.com/jupyterhub/jupyter-server-proxy)) and a Dask distributed cluster on the default port. Then they would need to click the link which would execute the malicious code.\n\n### Patches\nThis has been fixed in the `2026.1.1` release. All users should upgrade to this version.\n\n### Mitigations\nThere are no known workarounds for this bug. The only complete solution is to upgrade to a newer release of Dask. However, there are a few things you could do to reduce your risk.\n\nIt is possible to avoid code execution via Jupyter by uninstalling the [jupyter-server-proxy](https://github.com/jupyterhub/jupyter-server-proxy) and accessing the Dask dashboard directly at it's URL. However, it is still possible for an attacker to craft a URL that executes JavaScript in the user's browser in the Dask dashboard. Which is still a moderate vulnerability. Therefore we recommend all users upgrade to the latest Dask release.\n\nAnother potential mitigation is to ensure both Jupyter and the Dask dashboard are running on non-standard ports. While this doesn't resolve the problem it reduces the chance of this being exploited. If an attacker knew which ports you were using they could still craft a malicious URL, but it would require a more targeted attack.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2026-01-16T16:58:16Z",
    "Severity": "MODERATE",
    "Summary": "Dask Distributed is Vulnerable to Remote Code Execution via Jupyter Proxy and Dashboard",
    "UpdatedAt": "2026-01-16T16:58:17Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 0,
      "VectorString": ""
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "2026.1.1"
      },
      "VulnerableVersionRange": "\u003c 2026.1.1"
    }
  ]
}