{
  "Severity": "LOW",
  "UpdatedAt": "2026-02-19T22:09:13Z",
  "Package": {
    "Ecosystem": "GO",
    "Name": "github.com/sigstore/cosign"
  },
  "Advisory": {
    "DatabaseId": 338375,
    "Id": "GSA_kwCzR0hTQS13ZnF2LTY2dnEtNDZybc4ABSnH",
    "GhsaId": "GHSA-wfqv-66vq-46rm",
    "References": [
      {
        "Url": "https://github.com/sigstore/cosign/security/advisories/GHSA-wfqv-66vq-46rm"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2026-24122"
      },
      {
        "Url": "https://github.com/sigstore/cosign/commit/3c9a7363f563db76d78e2de2cabd945450f3781e"
      },
      {
        "Url": "https://github.com/sigstore/cosign/releases/tag/v3.0.5"
      },
      {
        "Url": "https://github.com/advisories/GHSA-wfqv-66vq-46rm"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-wfqv-66vq-46rm"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2026-24122"
      }
    ],
    "Description": "## Summary\n\nWhen verifying artifact signatures using a certificate, Cosign first verifies the certificate chain using the leaf certificate's \"not before\" timestamp and later checks expiry of the leaf certificate using either a signed timestamp provided by the Rekor transparency log or from a timestamp authority, or using the current time. The root and all issuing certificates are assumed to be valid during the leaf certificate's validity. An issuing certificate with a validity that expires before the leaf certificate will be considered valid during verification even if the provided timestamp would mean the issuing certificate should be considered expired.\n\n## Impact\n\nNo impact to users of the public Sigstore infrastructure. This may affect private deployments with customized PKIs. In practice, this is unlikely to occur as CAs should not be issuing certificates that outlive the validity of the CA and its parents.\n\n## Workarounds\n\nUpgrade to the latest release, or verify the certificate chain out of band.\n\n## Example to Reproduce\n\n* Root CA certificate is valid from 12pm-2pm\n* Intermediate CA certificate is valid from 12:30pm-1:30pm\n* Leaf certificate is valid from 1pm-3pm - **Note that this is unlikely to happen in practice**, as a CA shouldn't issue a certificate that would be valid after the issuing CA certificate expires\n* Signature generated at 2:30pm with a signed timestamp\n* During verification, the leaf certificate's not before time (1pm) is used to verify the chain - 1pm is in the validity windows for the root and intermediate CA certificates\n* The timestamp's time is checked to be in the validity window of only the leaf certificate - 2:30pm is in the validity window for the leaf\n* Even though the root and intermediate would be expired at 2:30pm, verification succeeds",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2026-02-19T22:09:12Z",
    "Severity": "LOW",
    "Summary": "Cosign considered signatures valid with expired intermediate certificates when transparency log verification is skipped",
    "UpdatedAt": "2026-02-20T16:43:56Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 3.7,
      "VectorString": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:L/A:N"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "3.0.5"
      },
      "VulnerableVersionRange": "\u003c= 3.0.4"
    }
  ]
}